#include <stdio.h> //подключаем стандартную библиотеку ввода-вывода

int main(int argc, char **argv) //точка входа в программу
{
	printf("   *   \n"); //печать строки и переход на новую строку
	printf("  ***  \n"); //печать строки и переход на новую строку
	printf(" ***** \n"); //печать строки и переход на новую строку
	printf("*******\n"); //печать строки и переход на новую строку
	printf(" HHOHH \n"); //печать строки и переход на новую строку
	printf(" ZZZZZ "); //печать строки
	return 0; //завершение программы с кодом 0
}

